In [5]:
import pandas as pd

s = pd.Series([3, -5, 7 ,4], index=['a', 'b', 'c', 'd'])

data = {
    'Country': ['Belgium', 'India', 'Brazil'],
    'Capital': ['Brussels', 'New Delhi', 'Brasília'],
    'Population': [11190846, 1303171035, 207847528]
    }

df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])

In [6]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [7]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528